In [1]:
import numpy as np 
import pandas as pd

In [2]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [3]:
df = pd.DataFrame(d)

In [4]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
# df.dropna() this drops all rows with a NaN
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
# df.dropna() this drops all cols with a NaN

df.dropna(axis=1)

   C
0  1
1  2
2  3

In [7]:
# df.dropna(thresh=2) this drops all rows with 2 or more NaNs
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [11]:
# you can pick a value to fill the NaN cells
df.fillna(value='fill')

      A     B  C
0   1.0   5.0  1
1   2.0  fill  2
2  fill  fill  3

In [12]:
#often times you will fill that value with the Mean of that col
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [18]:
df[df['A'].isnull()==False]

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [35]:
df2 = pd.DataFrame()

In [36]:
df2['A'] = df['A']

In [37]:
df2

     A
0  1.0
1  2.0
2  NaN

In [33]:
df.columns.difference(['B'])

Index(['A', 'C'], dtype='object')

In [38]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.duplicated('B')

0    False
1    False
2     True
dtype: bool

In [60]:
df[df.duplicated('B', keep= False)]

     A   B  C
1  2.0 NaN  2
2  NaN NaN  3